openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
  __IO uint8_t  UEP_TX_BURST;
  __IO uint8_t  UEP_TX_BURST_MODE;
  __IO uint8_t  UEP_RX_BURST;
  __IO uint8_t  UEP_RX_RES_MODE;

  __IO uint32_t UEP_AF_MODE;
  __IO uint32_t UEP0_DMA;
  __IO uint32_t UEP1_RX_DMA;
  __IO uint32_t UEP2_RX_DMA;
  __IO uint32_t UEP3_RX_DMA;
  __IO uint32_t UEP4_RX_DMA;
  __IO uint32_t UEP5_RX_DMA;
  __IO uint32_t UEP6_RX_DMA;
  __IO uint32_t UEP7_RX_DMA;
  __IO uint32_t UEP1_TX_DMA;
  __IO uint32_t UEP2_TX_DMA;
  __IO uint32_t UEP3_TX_DMA;
  __IO uint32_t UEP4_TX_DMA;
  __IO uint32_t UEP5_TX_DMA;
  __IO uint32_t UEP6_TX_DMA;
  __IO uint32_t UEP7_TX_DMA;
  __IO uint32_t UEP0_MAX_LEN;
  __IO uint32_t UEP1_MAX_LEN;
  __IO uint32_t UEP2_MAX_LEN;
  __IO uint32_t UEP3_MAX_LEN;
  __IO uint32_t UEP4_MAX_LEN;
  __IO uint32_t UEP5_MAX_LEN;
  __IO uint32_t UEP6_MAX_LEN;
  __IO uint32_t UEP7_MAX_LEN;

  __IO uint16_t UEP0_RX_LEN;
  uint16_t RESERVED1;
  __IO uint16_t UEP1_RX_LEN;
  __IO uint16_t UEP1_RX_SIZE;
  __IO uint16_t UEP2_RX_LEN;
  __IO uint16_t UEP2_RX_SIZE;
  __IO uint16_t UEP3_RX_LEN;
  __IO uint16_t UEP3_RX_SIZE;
  __IO uint16_t UEP4_RX_LEN;
  __IO uint16_t UEP4_RX_SIZE;
  __IO uint16_t UEP5_RX_LEN;
  __IO uint16_t UEP5_RX_SIZE;
  __IO uint16_t UEP6_RX_LEN;
  __IO uint16_t UEP6_RX_SIZE;
  __IO uint16_t UEP7_RX_LEN;
  __IO uint16_t UEP7_RX_SIZE;
  __IO uint16_t UEP0_TX_LEN;
  __IO uint8_t  UEP0_TX_CTRL;
  __IO uint8_t  UEP0_RX_CTRL;

  __IO uint16_t UEP1_TX_LEN;
  __IO uint8_t  UEP1_TX_CTRL;
  __IO uint8_t  UEP1_RX_CTRL;
  __IO uint16_t UEP2_TX_LEN;
  __IO uint8_t  UEP2_TX_CTRL;
  __IO uint8_t  UEP2_RX_CTRL;
  __IO uint16_t UEP3_TX_LEN;
  __IO uint8_t  UEP3_TX_CTRL;
  __IO uint8_t  UEP3_RX_CTRL;
  __IO uint16_t UEP4_TX_LEN;
  __IO uint8_t  UEP4_TX_CTRL;
  __IO uint8_t  UEP4_RX_CTRL;
  __IO uint16_t UEP5_TX_LEN;
  __IO uint8_t  UEP5_TX_CTRL;
  __IO uint8_t  UEP5_RX_CTRL;
  __IO uint16_t UEP6_TX_LEN;
  __IO uint8_t  UEP6_TX_CTRL;
  __IO uint8_t  UEP6_RX_CTRL;
  __IO uint16_t UEP7_TX_LEN;
  __IO uint8_t  UEP7_TX_CTRL;
  __IO uint8_t  UEP7_RX_CTRL;

  __IO uint16_t UEP_TX_ISO;
  __IO uint16_t UEP_RX_ISO;

  __IO uint32_t UEP1_RX_FIFO;
  __IO uint32_t UEP2_RX_FIFO;
  __IO uint32_t UEP3_RX_FIFO;
  __IO uint32_t UEP4_RX_FIFO;
  __IO uint32_t UEP5_RX_FIFO;
  __IO uint32_t UEP6_RX_FIFO;
  __IO uint32_t UEP7_RX_FIFO;
  __IO uint32_t UEP1_TX_FIFO;
  __IO uint32_t UEP2_TX_FIFO;
  __IO uint32_t UEP3_TX_FIFO;
  __IO uint32_t UEP4_TX_FIFO;
  __IO uint32_t UEP5_TX_FIFO;
  __IO uint32_t UEP6_TX_FIFO;
  __IO uint32_t UEP7_TX_FIFO;
} USBHSD_TypeDef;

/* USBHS Host Registers */
typedef struct  __attribute__((packed))
{
  __IO uint8_t  CFG;
  uint8_t  RESERVED0;
  __IO uint8_t  INT_EN;
  __IO uint8_t  DEV_ADDR;
  __IO uint32_t CONTROL;

  __IO uint8_t  INT_FLAG;
  __IO uint8_t  INT_ST;
  __IO uint8_t  MIS_ST;
  uint8_t  RESERVED1;

  __IO uint32_t LPM;
  __IO uint32_t SPLIT;
  __IO uint32_t FRAME;
  __IO uint32_t TX_LEN;
  __IO uint32_t RX_LEN;
  __IO uint32_t RX_MAX_LEN;
  __IO uint32_t RX_DMA;
  __IO uint32_t TX_DMA;
  __IO uint32_t PORT_CTRL;
  __IO uint8_t  PORT_CFG;
  uint8_t  RESERVED2;
  __IO uint8_t  PORT_INT_EN;
  __IO uint8_t  PORT_TEST_CT;

  __IO uint16_t PORT_STATUS;
  __IO uint8_t  PORT_STATUS_CHG;
  uint8_t  RESERVED3[5];
  __IO uint32_t ROOT_BC_CTRL;
} USBHSH_TypeDef;

/* Tounch key Converter */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t TRANS_CFG;
    __IO uint32_t CAP_CFG;
    __IO uint32_t DRV_CFG;
    __IO uint32_t CDCC;
    __IO uint32_t SR;
} TKEY_TypeDef;

/* FSMC Bank1 Registers */ 
typedef struct
{
  __IO uint32_t BTCR[8];
} FSMC_Bank1_TypeDef;

/* FSMC Bank1E Registers */ 
typedef struct
{
  __IO uint32_t BWTR[7];
} FSMC_Bank1E_TypeDef;

/* FSMC Bank2 Registers */ 
typedef struct
{
  __IO uint32_t PCR2;
  __IO uint32_t SR2;
  __IO uint32_t PMEM2;
  __IO uint32_t PATT2;
  uint32_t  RESERVED0;
  __IO uint32_t ECCR2;
} FSMC_Bank2_TypeDef;

/* QSPI Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t DCR;
  __IO uint32_t SR;
  __IO uint32_t FCR;
  __IO uint32_t DLR;
  __IO uint32_t CCR;
  __IO uint32_t AR;
  __IO uint32_t ABR;
  __IO uint32_t DR;
  __IO uint32_t PSMKR;
  __IO uint32_t PSMAR;
  __IO uint32_t PIR;
  __IO uint32_t LPTR;
} QSPI_TypeDef;

/* LVDS Registers */
typedef struct
{
  __IO uint16_t BASE_CFG;
  __IO uint16_t INT_EN;
  __IO uint16_t SHST_CR;
  __IO uint8_t LPM_CFG;
  __IO uint8_t DEV_ADDR;
  __IO uint16_t INT_FLAG;
  __IO uint16_t INT_ST;
  __IO uint32_t LINK_CR;
  __IO uint32_t LINK_ST;
  __IO uint16_t TXLPM_DAT;
  __IO uint16_t RXLPM_DAT;
  __IO uint32_t TX_LEN;
  __IO uint32_t RX_LEN;
  __IO uint32_t MAX_LEN;
  __IO uint32_t TX_DMA;
  __IO uint32_t RX_DMA;
  __IO uint8_t TX_CFG;
  __IO uint8_t RX_CFG;
  __IO uint8_t TX_CR;
  __IO uint8_t RX_CR;
} LVDS_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define FSMC_R_BASE                             ((uint32_t)0xA0000000) /* FSMC registers base address */

#define PB1PERIPH_BASE                          (PERIPH_BASE)
#define PB2PERIPH_BASE                          (PERIPH_BASE + 0x10000)
#define HBPERIPH_BASE                           (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (PB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (PB1PERIPH_BASE + 0x0400)
#define TIM4_BASE                               (PB1PERIPH_BASE + 0x0800)
#define USART6_BASE                             (PB1PERIPH_BASE + 0x1800)
#define USART7_BASE                             (PB1PERIPH_BASE + 0x1C00)
#define USART8_BASE                             (PB1PERIPH_BASE + 0x2000)
#define RTC_BASE                                (PB1PERIPH_BASE + 0x2800)
#define WWDG_BASE                               (PB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                               (PB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                               (PB1PERIPH_BASE + 0x3800)
#define USART2_BASE                             (PB1PERIPH_BASE + 0x4400)
#define USART3_BASE                             (PB1PERIPH_BASE + 0x4800)
#define USART4_BASE                             (PB1PERIPH_BASE + 0x4C00)
#define USART5_BASE                             (PB1PERIPH_BASE + 0x5000)
#define I2C1_BASE                               (PB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                               (PB1PERIPH_BASE + 0x5800)
#define CAN1_BASE                               (PB1PERIPH_BASE + 0x6400)
#define BKP_BASE                                (PB1PERIPH_BASE + 0x6C00)
#define PWR_BASE                                (PB1PERIPH_BASE + 0x7000)

#define AFIO_BASE                               (PB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (PB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (PB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (PB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (PB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                              (PB2PERIPH_BASE + 0x1400)
#define GPIOE_BASE                              (PB2PERIPH_BASE + 0x1800)
#define ADC1_BASE                               (PB2PERIPH_BASE + 0x2400)
#define TKEY_BASE                               (PB2PERIPH_BASE + 0x2458)
#define TIM1_BASE                               (PB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (PB2PERIPH_BASE + 0x3000)
#define USART1_BASE                             (PB2PERIPH_BASE + 0x3800)

#define DMA1_BASE                               (HBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (HBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (HBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (HBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (HBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (HBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (HBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (HBPERIPH_BASE + 0x0080)
#define DMA1_Channel8_BASE                      (HBPERIPH_BASE + 0x0094)
#define DMA2_BASE                               (HBPERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE                      (HBPERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE                      (HBPERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE                      (HBPERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE                      (HBPERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE                      (HBPERIPH_BASE + 0x0458)
#define DMA2_Channel6_BASE                      (HBPERIPH_BASE + 0x046C)
#define DMA2_Channel7_BASE                      (HBPERIPH_BASE + 0x0480)
#define DMA2_Channel8_BASE                      (HBPERIPH_BASE + 0x0494)

#define RCC_BASE                                (HBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE                            (HBPERIPH_BASE + 0x2000)
#define CRC_BASE                                (HBPERIPH_BASE + 0x3000)

#define USBHS_BASE                              (HBPERIPH_BASE + 0x3400)
#define USBHSD_BASE                             (USBHS_BASE)
#define USBHSH_BASE                             (USBHS_BASE + 0x100)

#define EXTEN_BASE                              (HBPERIPH_BASE + 0x3800)

#define QSPI1_BASE                              (HBPERIPH_BASE + 0x4C00)

#define PIOC_BASE                               (HBPERIPH_BASE + 0x5C00)

#define OPA_BASE                                (HBPERIPH_BASE + 0x6000)
#define USBPD_BASE                              (HBPERIPH_BASE + 0x7000)
#define LVDS_BASE                               (HBPERIPH_BASE + 0x7C00)

#define USBFS_BASE                              ((uint32_t)0x50000000)

#define FSMC_Bank1_R_BASE                       (FSMC_R_BASE + 0x0000) 
#define FSMC_Bank1E_R_BASE                      (FSMC_R_BASE + 0x0104) 
#define FSMC_Bank2_R_BASE                       (FSMC_R_BASE + 0x0060) 

#define OB_BASE                                 ((uint32_t)0x1FFFF800)

