openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define ADC_JL                                  ((uint32_t)0x00300000) /* JL[1:0] bits (Injected Sequence length) */
#define ADC_JL_0                                ((uint32_t)0x00100000) /* Bit 0 */
#define ADC_JL_1                                ((uint32_t)0x00200000) /* Bit 1 */

/*******************  Bit definition for ADC_IDATAR1 register  *******************/
#define ADC_IDATAR1_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR2 register  *******************/
#define ADC_IDATAR2_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR3 register  *******************/
#define ADC_IDATAR3_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/*******************  Bit definition for ADC_IDATAR4 register  *******************/
#define ADC_IDATAR4_JDATA                       ((uint16_t)0xFFFF) /* Injected data */

/********************  Bit definition for ADC_RDATAR register  ********************/
#define ADC_RDATAR_DATA                         ((uint32_t)0x0000FFFF) /* Regular data */

/******************************************************************************/
/*                            OPA registers                                */
/******************************************************************************/
/*******************  Bit definition for OPA_CFGR1 register  ********************/
#define OPA_CFGR1_BKIN_CFG                        ((uint32_t)0x00000018)
#define OPA_CFGR1_BKIN_CFG_0                      ((uint32_t)0x00000008)
#define OPA_CFGR1_BKIN_CFG_1                      ((uint32_t)0x00000010)

#define OPA_CFGR1_RST_EN1                         ((uint32_t)0x00000020)
#define OPA_CFGR1_IE_OUT1                         ((uint32_t)0x00000100)
#define OPA_CFGR1_IE_CNT1                         ((uint32_t)0x00000200)
#define OPA_CFGR1_NMI_EN1                         ((uint32_t)0x00000400)

#define OPA_CFGR1_STCFG1                          ((uint32_t)0x00FF0000)
#define OPA_CFGR1_SMPSEL1                         ((uint32_t)0x10000000)
#define OPA_CFGR1_POLLMD1                         ((uint32_t)0x20000000)
#define OPA_CFGR1_OPA_LOCK                        ((uint32_t)0x80000000)

/*******************  Bit definition for OPA_CTLR1 register  ********************/
#define OPA_CTLR1_EN1                             ((uint32_t)0x00000001)
#define OPA_CTLR1_MODE1                           ((uint32_t)0x00000006)
#define OPA_CTLR1_MODE1_0                         ((uint32_t)0x00000002)
#define OPA_CTLR1_MODE1_1                         ((uint32_t)0x00000004)

#define OPA_CTLR1_PSEL1                           ((uint32_t)0x00000018)
#define OPA_CTLR1_PSEL1_0                         ((uint32_t)0x00000008)
#define OPA_CTLR1_PSEL1_1                         ((uint32_t)0x00000010)

#define OPA_CTLR1_NSEL1                           ((uint32_t)0x00000020)

#define OPA_CTLR1_PGA_SEL1                        ((uint32_t)0x00000300)
#define OPA_CTLR1_PGA_SEL1_0                      ((uint32_t)0x00000100)
#define OPA_CTLR1_PGA_SEL1_1                      ((uint32_t)0x00000200)

#define OPA_CTLR1_FB_EN1                          ((uint32_t)0x00000400)
#define OPA_CTLR1_PGADIF1                         ((uint32_t)0x00000800)
#define OPA_CTLR1_HS1                             ((uint32_t)0x00001000)

#define OPA_CTLR1_POLL_EN1                        ((uint32_t)0x00010000)

#define OPA_CTLR1_POLL1_NUM                       ((uint32_t)0x00060000)
#define OPA_CTLR1_POLL1_NUM_0                     ((uint32_t)0x00020000)
#define OPA_CTLR1_POLL1_NUM_1                     ((uint32_t)0x00040000)

#define OPA_CTLR1_POLL1_NUM1                      ((uint32_t)0x00000000)
#define OPA_CTLR1_POLL1_NUM2                      ((uint32_t)0x00020000)
#define OPA_CTLR1_POLL1_NUM3                      ((uint32_t)0x00040000)

#define OPA_CTLR1_POLL_SEL                        ((uint32_t)0x00380000)
#define OPA_CTLR1_POLL_SEL_0                      ((uint32_t)0x00080000)
#define OPA_CTLR1_POLL_SEL_1                      ((uint32_t)0x00100000)
#define OPA_CTLR1_POLL_SEL_2                      ((uint32_t)0x00200000)

#define OPA_CTLR1_POLL_SWSTRT                     ((uint32_t)0x00800000)
#define OPA_CTLR1_POLL_CH1                        ((uint32_t)0x03000000)
#define OPA_CTLR1_POLL_CH2                        ((uint32_t)0x0C000000)
#define OPA_CTLR1_POLL_CH3                        ((uint32_t)0x30000000)

/*******************  Bit definition for OPA_CTLR2 register  ********************/
#define  OPA_CTLR2_EN2                            ((uint16_t)0x0001)
#define  OPA_CTLR2_MODE2                          ((uint16_t)0x0006)
#define  OPA_CTLR2_MODE2_0                        ((uint16_t)0x0002)
#define  OPA_CTLR2_MODE2_1                        ((uint16_t)0x0004)

#define  OPA_CTLR2_PSEL2                          ((uint16_t)0x0008)
#define  OPA_CTLR2_NSEL2                          ((uint16_t)0x0020)
#define  OPA_CTLR2_PGA_SEL2                       ((uint16_t)0x0300)
#define  OPA_CTLR2_FB_EN2                         ((uint16_t)0x0400)
#define  OPA_CTLR2_PGADIF2                        ((uint16_t)0x0800)
#define  OPA_CTLR2_HS2                            ((uint16_t)0x1000)

/*******************  Bit definition for CMP_CTLR register  ********************/
#define  CMP_CTLR_EN1                         ((uint16_t)0x0001)
#define  CMP_CTLR_MODE1                       ((uint16_t)0x0006)
#define  CMP_CTLR_MODE1_0                     ((uint16_t)0x0002)
#define  CMP_CTLR_MODE1_1                     ((uint16_t)0x0004)

#define  CMP_CTLR_NSEL1                       ((uint16_t)0x0018)
#define  CMP_CTLR_NSEL1_0                     ((uint16_t)0x0008)
#define  CMP_CTLR_NSEL1_1                     ((uint16_t)0x0010)

#define  CMP_CTLR_PSEL1                       ((uint16_t)0x0060)
#define  CMP_CTLR_PSEL1_0                     ((uint16_t)0x0020)
#define  CMP_CTLR_PSEL1_1                     ((uint16_t)0x0040)

#define  CMP_CTLR_HYEN1                       ((uint16_t)0x0080)

#define  CMP_CTLR_EN2                         ((uint16_t)0x0100)
#define  CMP_CTLR_MODE2                       ((uint16_t)0x0600)
#define  CMP_CTLR_MODE2_0                     ((uint16_t)0x0200)
#define  CMP_CTLR_MODE2_1                     ((uint16_t)0x0400)

#define  CMP_CTLR_NSEL2                       ((uint16_t)0x1800)
#define  CMP_CTLR_NSEL2_0                     ((uint16_t)0x0800)
#define  CMP_CTLR_NSEL2_1                     ((uint16_t)0x1000)

#define  CMP_CTLR_PSEL2                       ((uint16_t)0x6000)
#define  CMP_CTLR_PSEL2_0                     ((uint16_t)0x2000)
#define  CMP_CTLR_PSEL2_1                     ((uint16_t)0x4000)

#define  CMP_CTLR_HYEN2                       ((uint16_t)0x8000)

#define  CMP_CTLR_RST_EN1                     ((uint32_t)0x00010000)
#define  CMP_CTLR_RST_EN2                     ((uint32_t)0x00020000)
#define  CMP_CTLR_BKIN_SEL                    ((uint32_t)0x00040000)

#define  CMP_CTLR_LP1                         ((uint32_t)0x00100000)
#define  CMP_CTLR_LP2                         ((uint32_t)0x00200000)
#define  CMP_CTLR_WKUP_MD                     ((uint32_t)0x00C00000)
#define  CMP_CTLR_WKUP_MD_0                   ((uint32_t)0x00400000)
#define  CMP_CTLR_WKUP_MD_1                   ((uint32_t)0x00800000)

#define  CMP_CTLR_DACEN                       ((uint32_t)0x01000000)

#define  CMP_CTLR_DACDAT                      ((uint32_t)0x1E000000)
#define  CMP_CTLR_DACDAT_0                    ((uint32_t)0x02000000)
#define  CMP_CTLR_DACDAT_1                    ((uint32_t)0x04000000)
#define  CMP_CTLR_DACDAT_2                    ((uint32_t)0x08000000)
#define  CMP_CTLR_DACDAT_3                    ((uint32_t)0x10000000)

#define  CMP_CTLR_HYS1_H                      ((uint32_t)0x20000000)
#define  CMP_CTLR_HYS2_H                      ((uint32_t)0x40000000)

