openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define  CMP_CTLR_CMP_LOCK                    ((uint32_t)0x80000000)

/*******************  Bit definition for CMP_FILT register  ********************/
#define  CMP_FILT_EN1                         ((uint16_t)0x0001)
#define  CMP_FILT_FILT1                       ((uint16_t)0x003E)
#define  CMP_FILT_EN2                         ((uint16_t)0x0100)
#define  CMP_FILT_FILT2                       ((uint16_t)0x3E00)

/*******************  Bit definition for OPA_KEY register  ********************/
#define  OPA_OPA_KEY                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for CMP_KEY register  ********************/
#define  CMP_CMP_KEY                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for OPCM_SR register  ********************/
#define  OPCM_SR_IF_OUT_POLL_CH1              ((uint32_t)0x0001)
#define  OPCM_SR_IF_OUT_POLL_CH2              ((uint32_t)0x0002)
#define  OPCM_SR_IF_OUT_POLL_CH3              ((uint32_t)0x0004)
#define  OPCM_SR_IF_POLL_OPA1                 ((uint32_t)0x0010)

/******************************************************************************/
/*                            FSMC registers                                */
/******************************************************************************/

/*******************  Bit definition for FSMC_BCR1 register  ********************/
#define  FSMC_BCR1_MBKEN                      ((uint32_t)0x00000001)
#define  FSMC_BCR1_MUXEN                      ((uint32_t)0x00000002)

#define  FSMC_BCR1_MTYP                       ((uint32_t)0x0000000C)
#define  FSMC_BCR1_MTYP_0                     ((uint32_t)0x00000004)
#define  FSMC_BCR1_MTYP_1                     ((uint32_t)0x00000008)
#define  FSMC_BCR1_MTYP_SRAM_ROM              ((uint32_t)0x00000000)
#define  FSMC_BCR1_MTYP_PRAM                  ((uint32_t)0x00000004)
#define  FSMC_BCR1_MTYP_NORFLASH              ((uint32_t)0x00000008)

#define  FSMC_BCR1_MWID                       ((uint32_t)0x00000030)
#define  FSMC_BCR1_MWID_0                     ((uint32_t)0x00000010)
#define  FSMC_BCR1_MWID_1                     ((uint32_t)0x00000020)
#define  FSMC_BCR1_MWID_8bit                  ((uint32_t)0x00000000)
#define  FSMC_BCR1_MWID_16bit                 ((uint32_t)0x00000010)

#define  FSMC_BCR1_FACCEN                     ((uint32_t)0x00000040)
#define  FSMC_BCR1_BURSTEN                    ((uint32_t)0x00000100)
#define  FSMC_BCR1_WAITPOL                    ((uint32_t)0x00000200)
#define  FSMC_BCR1_WAITCFG                    ((uint32_t)0x00000800)
#define  FSMC_BCR1_WREN                       ((uint32_t)0x00001000)
#define  FSMC_BCR1_WAITEN                     ((uint32_t)0x00002000)
#define  FSMC_BCR1_EXTMOD                     ((uint32_t)0x00004000)
#define  FSMC_BCR1_ASYNCWAIT                  ((uint32_t)0x00008000)
#define  FSMC_BCR1_CBURSTRW                   ((uint32_t)0x00080000)

/*******************  Bit definition for FSMC_BTR1 register  ********************/
#define  FSMC_BTR1_ADDSET                     ((uint32_t)0x0000000F)
#define  FSMC_BTR1_ADDSET_0                   ((uint32_t)0x00000001)
#define  FSMC_BTR1_ADDSET_1                   ((uint32_t)0x00000002)
#define  FSMC_BTR1_ADDSET_2                   ((uint32_t)0x00000004)
#define  FSMC_BTR1_ADDSET_3                   ((uint32_t)0x00000008)

#define  FSMC_BTR1_ADDHLD                     ((uint32_t)0x000000F0)
#define  FSMC_BTR1_ADDHLD_0                   ((uint32_t)0x00000010)
#define  FSMC_BTR1_ADDHLD_1                   ((uint32_t)0x00000020)
#define  FSMC_BTR1_ADDHLD_2                   ((uint32_t)0x00000040)
#define  FSMC_BTR1_ADDHLD_3                   ((uint32_t)0x00000080)

#define  FSMC_BTR1_DATAST                     ((uint32_t)0x0000FF00)
#define  FSMC_BTR1_DATAST_0                   ((uint32_t)0x00000100)
#define  FSMC_BTR1_DATAST_1                   ((uint32_t)0x00000200)
#define  FSMC_BTR1_DATAST_2                   ((uint32_t)0x00000400)
#define  FSMC_BTR1_DATAST_3                   ((uint32_t)0x00000800)
#define  FSMC_BTR1_DATAST_4                   ((uint32_t)0x00001000)
#define  FSMC_BTR1_DATAST_5                   ((uint32_t)0x00002000)
#define  FSMC_BTR1_DATAST_6                   ((uint32_t)0x00004000)
#define  FSMC_BTR1_DATAST_7                   ((uint32_t)0x00008000)

#define  FSMC_BTR1_BUSTURN                    ((uint32_t)0x000F0000)
#define  FSMC_BTR1_BUSTURN_0                  ((uint32_t)0x00010000)
#define  FSMC_BTR1_BUSTURN_1                  ((uint32_t)0x00020000)
#define  FSMC_BTR1_BUSTURN_2                  ((uint32_t)0x00040000)
#define  FSMC_BTR1_BUSTURN_3                  ((uint32_t)0x00080000)

#define  FSMC_BTR1_CLKDIV                     ((uint32_t)0x00F00000)
#define  FSMC_BTR1_CLKDIV_0                   ((uint32_t)0x00100000)
#define  FSMC_BTR1_CLKDIV_1                   ((uint32_t)0x00200000)
#define  FSMC_BTR1_CLKDIV_2                   ((uint32_t)0x00400000)
#define  FSMC_BTR1_CLKDIV_3                   ((uint32_t)0x00800000)

#define  FSMC_BTR1_DATLAT                     ((uint32_t)0x0F000000)
#define  FSMC_BTR1_DATLAT_0                   ((uint32_t)0x01000000)
#define  FSMC_BTR1_DATLAT_1                   ((uint32_t)0x02000000)
#define  FSMC_BTR1_DATLAT_2                   ((uint32_t)0x04000000)
#define  FSMC_BTR1_DATLAT_3                   ((uint32_t)0x08000000)

#define  FSMC_BTR1_ACCMOD                     ((uint32_t)0x30000000)
#define  FSMC_BTR1_ACCMOD_0                   ((uint32_t)0x10000000)
#define  FSMC_BTR1_ACCMOD_1                   ((uint32_t)0x20000000)
#define  FSMC_BTR1_ACCMOD_ModeA               ((uint32_t)0x00000000)
#define  FSMC_BTR1_ACCMOD_ModeB               ((uint32_t)0x10000000)
#define  FSMC_BTR1_ACCMOD_ModeC               ((uint32_t)0x20000000)
#define  FSMC_BTR1_ACCMOD_ModeD               ((uint32_t)0x30000000)

/*******************  Bit definition for FSMC_PCR2 register  ********************/
#define  FSMC_PCR2_PWAITEN                    ((uint32_t)0x00000002)
#define  FSMC_PCR2_PBKEN                      ((uint32_t)0x00000004)
#define  FSMC_PCR2_PTYP                       ((uint32_t)0x00000008)

#define  FSMC_PCR2_PWID                       ((uint32_t)0x00000030)
#define  FSMC_PCR2_PWID_0                     ((uint32_t)0x00000010)
#define  FSMC_PCR2_PWID_1                     ((uint32_t)0x00000020)
#define  FSMC_PCR2_PWID_8Bit                  ((uint32_t)0x00000000)
#define  FSMC_PCR2_PWID_16Bit                 ((uint32_t)0x00000010)

#define  FSMC_PCR2_ECCEN                      ((uint32_t)0x00000040)

#define  FSMC_PCR2_TCLR                       ((uint32_t)0x00001F00)
#define  FSMC_PCR2_TCLR_0                     ((uint32_t)0x00000200)
#define  FSMC_PCR2_TCLR_1                     ((uint32_t)0x00000400)
#define  FSMC_PCR2_TCLR_2                     ((uint32_t)0x00000800)
#define  FSMC_PCR2_TCLR_3                     ((uint32_t)0x00001000)

#define  FSMC_PCR2_TAR                        ((uint32_t)0x0001F000)
#define  FSMC_PCR2_TAR_0                      ((uint32_t)0x00002000)
#define  FSMC_PCR2_TAR_1                      ((uint32_t)0x00004000)
#define  FSMC_PCR2_TAR_2                      ((uint32_t)0x00008000)
#define  FSMC_PCR2_TAR_3                      ((uint32_t)0x00010000)

