openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define  FSMC_PCR2_ECCPS                      ((uint32_t)0x000E0000)
#define  FSMC_PCR2_ECCPS_0                    ((uint32_t)0x00020000)
#define  FSMC_PCR2_ECCPS_1                    ((uint32_t)0x00040000)
#define  FSMC_PCR2_ECCPS_2                    ((uint32_t)0x00080000)

/*******************  Bit definition for FSMC_SR2 register  ********************/
#define  FSMC_SR2_FEMPT                       ((uint32_t)0x00000040)

/*******************  Bit definition for FSMC_PMEM2 register  ********************/
#define  FSMC_PMEM2_MEMSETx                   ((uint32_t)0x000000FF)
#define  FSMC_PMEM2_MEMSETx_0                 ((uint32_t)0x00000001)
#define  FSMC_PMEM2_MEMSETx_1                 ((uint32_t)0x00000002)
#define  FSMC_PMEM2_MEMSETx_2                 ((uint32_t)0x00000004)
#define  FSMC_PMEM2_MEMSETx_3                 ((uint32_t)0x00000008)
#define  FSMC_PMEM2_MEMSETx_4                 ((uint32_t)0x00000010)
#define  FSMC_PMEM2_MEMSETx_5                 ((uint32_t)0x00000020)
#define  FSMC_PMEM2_MEMSETx_6                 ((uint32_t)0x00000040)
#define  FSMC_PMEM2_MEMSETx_7                 ((uint32_t)0x00000080)

#define  FSMC_PMEM2_MEMWAITx                   ((uint32_t)0x0000FF00)
#define  FSMC_PMEM2_MEMWAITx_0                 ((uint32_t)0x00000100)
#define  FSMC_PMEM2_MEMWAITx_1                 ((uint32_t)0x00000200)
#define  FSMC_PMEM2_MEMWAITx_2                 ((uint32_t)0x00000400)
#define  FSMC_PMEM2_MEMWAITx_3                 ((uint32_t)0x00000800)
#define  FSMC_PMEM2_MEMWAITx_4                 ((uint32_t)0x00001000)
#define  FSMC_PMEM2_MEMWAITx_5                 ((uint32_t)0x00002000)
#define  FSMC_PMEM2_MEMWAITx_6                 ((uint32_t)0x00004000)
#define  FSMC_PMEM2_MEMWAITx_7                 ((uint32_t)0x00008000)

#define  FSMC_PMEM2_MEMHOLDx                   ((uint32_t)0x00FF0000)
#define  FSMC_PMEM2_MEMHOLDx_0                 ((uint32_t)0x00010000)
#define  FSMC_PMEM2_MEMHOLDx_1                 ((uint32_t)0x00020000)
#define  FSMC_PMEM2_MEMHOLDx_2                 ((uint32_t)0x00040000)
#define  FSMC_PMEM2_MEMHOLDx_3                 ((uint32_t)0x00080000)
#define  FSMC_PMEM2_MEMHOLDx_4                 ((uint32_t)0x00100000)
#define  FSMC_PMEM2_MEMHOLDx_5                 ((uint32_t)0x00200000)
#define  FSMC_PMEM2_MEMHOLDx_6                 ((uint32_t)0x00400000)
#define  FSMC_PMEM2_MEMHOLDx_7                 ((uint32_t)0x00800000)

#define  FSMC_PMEM2_MEMHIZx                    ((uint32_t)0xFF000000)
#define  FSMC_PMEM2_MEMHIZx_0                  ((uint32_t)0x01000000)
#define  FSMC_PMEM2_MEMHIZx_1                  ((uint32_t)0x02000000)
#define  FSMC_PMEM2_MEMHIZx_2                  ((uint32_t)0x04000000)
#define  FSMC_PMEM2_MEMHIZx_3                  ((uint32_t)0x08000000)
#define  FSMC_PMEM2_MEMHIZx_4                  ((uint32_t)0x10000000)
#define  FSMC_PMEM2_MEMHIZx_5                  ((uint32_t)0x20000000)
#define  FSMC_PMEM2_MEMHIZx_6                  ((uint32_t)0x40000000)
#define  FSMC_PMEM2_MEMHIZx_7                  ((uint32_t)0x80000000)

/*******************  Bit definition for FSMC_PATT2 register  ********************/
#define  FSMC_PATT2_ATTSETx                   ((uint32_t)0x000000FF)
#define  FSMC_PATT2_ATTSETx_0                 ((uint32_t)0x00000001)
#define  FSMC_PATT2_ATTSETx_1                 ((uint32_t)0x00000002)
#define  FSMC_PATT2_ATTSETx_2                 ((uint32_t)0x00000004)
#define  FSMC_PATT2_ATTSETx_3                 ((uint32_t)0x00000008)
#define  FSMC_PATT2_ATTSETx_4                 ((uint32_t)0x00000010)
#define  FSMC_PATT2_ATTSETx_5                 ((uint32_t)0x00000020)
#define  FSMC_PATT2_ATTSETx_6                 ((uint32_t)0x00000040)
#define  FSMC_PATT2_ATTSETx_7                 ((uint32_t)0x00000080)

#define  FSMC_PATT2_ATTWAITx                   ((uint32_t)0x0000FF00)
#define  FSMC_PATT2_ATTWAITx_0                 ((uint32_t)0x00000100)
#define  FSMC_PATT2_ATTWAITx_1                 ((uint32_t)0x00000200)
#define  FSMC_PATT2_ATTWAITx_2                 ((uint32_t)0x00000400)
#define  FSMC_PATT2_ATTWAITx_3                 ((uint32_t)0x00000800)
#define  FSMC_PATT2_ATTWAITx_4                 ((uint32_t)0x00001000)
#define  FSMC_PATT2_ATTWAITx_5                 ((uint32_t)0x00002000)
#define  FSMC_PATT2_ATTWAITx_6                 ((uint32_t)0x00004000)
#define  FSMC_PATT2_ATTWAITx_7                 ((uint32_t)0x00008000)

#define  FSMC_PATT2_ATTHOLDx                   ((uint32_t)0x00FF0000)
#define  FSMC_PATT2_ATTHOLDx_0                 ((uint32_t)0x00010000)
#define  FSMC_PATT2_ATTHOLDx_1                 ((uint32_t)0x00020000)
#define  FSMC_PATT2_ATTHOLDx_2                 ((uint32_t)0x00040000)
#define  FSMC_PATT2_ATTHOLDx_3                 ((uint32_t)0x00080000)
#define  FSMC_PATT2_ATTHOLDx_4                 ((uint32_t)0x00100000)
#define  FSMC_PATT2_ATTHOLDx_5                 ((uint32_t)0x00200000)
#define  FSMC_PATT2_ATTHOLDx_6                 ((uint32_t)0x00400000)
#define  FSMC_PATT2_ATTHOLDx_7                 ((uint32_t)0x00800000)

#define  FSMC_PATT2_ATTHIZx                    ((uint32_t)0xFF000000)
#define  FSMC_PATT2_ATTHIZx_0                  ((uint32_t)0x01000000)
#define  FSMC_PATT2_ATTHIZx_1                  ((uint32_t)0x02000000)
#define  FSMC_PATT2_ATTHIZx_2                  ((uint32_t)0x04000000)
#define  FSMC_PATT2_ATTHIZx_3                  ((uint32_t)0x08000000)
#define  FSMC_PATT2_ATTHIZx_4                  ((uint32_t)0x10000000)
#define  FSMC_PATT2_ATTHIZx_5                  ((uint32_t)0x20000000)
#define  FSMC_PATT2_ATTHIZx_6                  ((uint32_t)0x40000000)
#define  FSMC_PATT2_ATTHIZx_7                  ((uint32_t)0x80000000)

/*******************  Bit definition for FSMC_ECCR2 register  ********************/
#define  FSMC_ECCR2_ECC                        ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for FSMC_BWTR1 register  ********************/
#define  FSMC_BWTR1_ADDSET                     ((uint32_t)0x0000000F)
#define  FSMC_BWTR1_ADDSET_0                   ((uint32_t)0x00000001)
#define  FSMC_BWTR1_ADDSET_1                   ((uint32_t)0x00000002)
#define  FSMC_BWTR1_ADDSET_2                   ((uint32_t)0x00000004)
#define  FSMC_BWTR1_ADDSET_3                   ((uint32_t)0x00000008)

