openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define  FSMC_BWTR1_ADDHLD                     ((uint32_t)0x000000F0)
#define  FSMC_BWTR1_ADDHLD_0                   ((uint32_t)0x00000010)
#define  FSMC_BWTR1_ADDHLD_1                   ((uint32_t)0x00000020)
#define  FSMC_BWTR1_ADDHLD_2                   ((uint32_t)0x00000040)
#define  FSMC_BWTR1_ADDHLD_3                   ((uint32_t)0x00000080)

#define  FSMC_BWTR1_DATAST                     ((uint32_t)0x0000FF00)
#define  FSMC_BWTR1_DATAST_0                   ((uint32_t)0x00000100)
#define  FSMC_BWTR1_DATAST_1                   ((uint32_t)0x00000200)
#define  FSMC_BWTR1_DATAST_2                   ((uint32_t)0x00000400)
#define  FSMC_BWTR1_DATAST_3                   ((uint32_t)0x00000800)
#define  FSMC_BWTR1_DATAST_4                   ((uint32_t)0x00001000)
#define  FSMC_BWTR1_DATAST_5                   ((uint32_t)0x00002000)
#define  FSMC_BWTR1_DATAST_6                   ((uint32_t)0x00004000)
#define  FSMC_BWTR1_DATAST_7                   ((uint32_t)0x00008000)

#define  FSMC_BWTR1_BUSTYRN                    ((uint32_t)0x000F0000)
#define  FSMC_BWTR1_BUSTYRN_0                  ((uint32_t)0x00010000)
#define  FSMC_BWTR1_BUSTYRN_1                  ((uint32_t)0x00020000)
#define  FSMC_BWTR1_BUSTYRN_2                  ((uint32_t)0x00040000)
#define  FSMC_BWTR1_BUSTYRN_3                  ((uint32_t)0x00080000)

#define  FSMC_BWTR1_ACCMOD                     ((uint32_t)0x30000000)
#define  FSMC_BWTR1_ACCMOD_0                   ((uint32_t)0x10000000)
#define  FSMC_BWTR1_ACCMOD_1                   ((uint32_t)0x20000000)

#define  FSMC_BWTR1_ACCMOD_MODA                ((uint32_t)0x00000000)
#define  FSMC_BWTR1_ACCMOD_MODB                ((uint32_t)0x10000000)
#define  FSMC_BWTR1_ACCMOD_MODC                ((uint32_t)0x20000000)
#define  FSMC_BWTR1_ACCMOD_MODD                ((uint32_t)0x30000000)

/******************************************************************************/
/*                            TKEY registers                                */
/******************************************************************************/

/*******************  Bit definition for TKEY_CTLR register  ********************/
#define   TKEY_CTLR_TKEN                       ((uint16_t)0x0001)
#define   TKEY_CTLR_ITUNE                      ((uint16_t)0x0002)
#define   TKEY_CTLR_MODE                       ((uint16_t)0x0004)
#define   TKEY_CTLR_CHSEL                      ((uint16_t)0x0008)
#define   TKEY_CTLR_TKACT                      ((uint16_t)0x0100)
#define   TKEY_CTLR_SCANIE                     ((uint16_t)0x0400)
#define   TKEY_CTLR_SCANEN                     ((uint16_t)0x0800)

#define   TKEY_CTLR_SCANNUM                    ((uint16_t)0xF000)
#define   TKEY_CTLR_SCANNUM_0                  ((uint16_t)0x1000)
#define   TKEY_CTLR_SCANNUM_1                  ((uint16_t)0x2000)
#define   TKEY_CTLR_SCANNUM_2                  ((uint16_t)0x4000)
#define   TKEY_CTLR_SCANNUM_3                  ((uint16_t)0x8000)

/*******************  Bit definition for TKEY_TRANS_CFG register  ********************/
#define   TKEY_TRANS_CFG_TRANSCC               ((uint16_t)0x0007)
#define   TKEY_TRANS_CFG_TRANSCC_0             ((uint16_t)0x0001)
#define   TKEY_TRANS_CFG_TRANSCC_1             ((uint16_t)0x0002)
#define   TKEY_TRANS_CFG_TRANSCC_2             ((uint16_t)0x0004)

#define   TKEY_TRANS_CFG_TRANSN                ((uint16_t)0x1FF8)
#define   TKEY_TRANS_CFG_TKSW                  ((uint16_t)0x6000)
#define   TKEY_TRANS_CFG_TKSW_0                ((uint16_t)0x2000)
#define   TKEY_TRANS_CFG_TKSW_1                ((uint16_t)0x4000)

#define   TKEY_TRANS_CFG_TKSW_1Tclk            ((uint16_t)0x0000)
#define   TKEY_TRANS_CFG_TKSW_2Tclk            ((uint16_t)0x2000)
#define   TKEY_TRANS_CFG_TKSW_4Tclk            ((uint16_t)0x4000)
#define   TKEY_TRANS_CFG_TKSW_8Tclk            ((uint16_t)0x6000)

/*******************  Bit definition for TKEY_CAP_CFG register  ********************/
#define   TKEY_CAP_CFG_SELCX                   ((uint32_t)0x0000000F)
#define   TKEY_CAP_CFG_SELCX_0                 ((uint32_t)0x00000001)
#define   TKEY_CAP_CFG_SELCX_1                 ((uint32_t)0x00000002)
#define   TKEY_CAP_CFG_SELCX_2                 ((uint32_t)0x00000004)
#define   TKEY_CAP_CFG_SELCX_3                 ((uint32_t)0x00000008)

#define   TKEY_CAP_CFG_SELCS                   ((uint32_t)0x000FFFF0)
#define   TKEY_CAP_CFG_SELCS_0                 ((uint32_t)0x00000010)
#define   TKEY_CAP_CFG_SELCS_1                 ((uint32_t)0x00000020)
#define   TKEY_CAP_CFG_SELCS_2                 ((uint32_t)0x00000040)
#define   TKEY_CAP_CFG_SELCS_3                 ((uint32_t)0x00000080)
#define   TKEY_CAP_CFG_SELCS_4                 ((uint32_t)0x00000100)
#define   TKEY_CAP_CFG_SELCS_5                 ((uint32_t)0x00000200)
#define   TKEY_CAP_CFG_SELCS_6                 ((uint32_t)0x00000400)
#define   TKEY_CAP_CFG_SELCS_7                 ((uint32_t)0x00000800)
#define   TKEY_CAP_CFG_SELCS_8                 ((uint32_t)0x00001000)
#define   TKEY_CAP_CFG_SELCS_9                 ((uint32_t)0x00002000)
#define   TKEY_CAP_CFG_SELCS_10                ((uint32_t)0x00004000)
#define   TKEY_CAP_CFG_SELCS_11                ((uint32_t)0x00008000)
#define   TKEY_CAP_CFG_SELCS_12                ((uint32_t)0x00010000)
#define   TKEY_CAP_CFG_SELCS_13                ((uint32_t)0x00020000)
#define   TKEY_CAP_CFG_SELCS_14                ((uint32_t)0x00040000)
#define   TKEY_CAP_CFG_SELCS_15                ((uint32_t)0x00080000)

/*******************  Bit definition for TKEY_DRV_CFG register  ********************/
#define   TKEY_DRV_CFG_DRVEN                   ((uint32_t)0x00000001)

#define   TKEY_DRV_CFG_DRVOUTSEL               ((uint32_t)0xFFFF0000)
#define   TKEY_DRV_CFG_DRVOUTSEL_0             ((uint32_t)0x00010000)
#define   TKEY_DRV_CFG_DRVOUTSEL_1             ((uint32_t)0x00020000)
#define   TKEY_DRV_CFG_DRVOUTSEL_2             ((uint32_t)0x00040000)
#define   TKEY_DRV_CFG_DRVOUTSEL_3             ((uint32_t)0x00080000)
#define   TKEY_DRV_CFG_DRVOUTSEL_4             ((uint32_t)0x00100000)
#define   TKEY_DRV_CFG_DRVOUTSEL_5             ((uint32_t)0x00200000)
#define   TKEY_DRV_CFG_DRVOUTSEL_6             ((uint32_t)0x00400000)
#define   TKEY_DRV_CFG_DRVOUTSEL_7             ((uint32_t)0x00800000)
#define   TKEY_DRV_CFG_DRVOUTSEL_8             ((uint32_t)0x01000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_9             ((uint32_t)0x02000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_10            ((uint32_t)0x04000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_11            ((uint32_t)0x08000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_12            ((uint32_t)0x10000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_13            ((uint32_t)0x20000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_14            ((uint32_t)0x40000000)
#define   TKEY_DRV_CFG_DRVOUTSEL_15            ((uint32_t)0x80000000)

/*******************  Bit definition for TKEY_CDCC register  ********************/
#define   TKEY_CDCC_TKCD                       ((uint32_t)0x000007FF)
#define   TKEY_CDCC_TKCC                       ((uint32_t)0x07FF0000)

/*******************  Bit definition for TKEY_SR register  ********************/
#define   TKEY_SR_SCANIF                       ((uint16_t)0x0001)

/*******************  Bit definition for TKEY_RSQR1 register  ********************/
#define   TKEY_RSQR1_SQ13                      ((uint32_t)0x0000001F)
#define   TKEY_RSQR1_SQ14                      ((uint32_t)0x000003E0)
#define   TKEY_RSQR1_SQ15                      ((uint32_t)0x00007C00)
#define   TKEY_RSQR1_SQ16                      ((uint32_t)0x000F8000)

/*******************  Bit definition for TKEY_RSQR2 register  ********************/
#define   TKEY_RSQR1_SQ7                       ((uint32_t)0x0000001F)
#define   TKEY_RSQR1_SQ8                       ((uint32_t)0x000003E0)
#define   TKEY_RSQR1_SQ9                       ((uint32_t)0x00007C00)
#define   TKEY_RSQR1_SQ10                      ((uint32_t)0x000F8000)
#define   TKEY_RSQR1_SQ11                      ((uint32_t)0x01F00000)
#define   TKEY_RSQR1_SQ12                      ((uint32_t)0x3E000000)

