openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define AFIO_EXTICR4_EXTI15_PA                  ((uint16_t)0x0000) /* PA[15] pin */
#define AFIO_EXTICR4_EXTI15_PB                  ((uint16_t)0x1000) /* PB[15] pin */
#define AFIO_EXTICR4_EXTI15_PC                  ((uint16_t)0x2000) /* PC[15] pin */
#define AFIO_EXTICR4_EXTI15_PD                  ((uint16_t)0x3000) /* PD[15] pin */
#define AFIO_EXTICR4_EXTI15_PE                  ((uint16_t)0x4000) /* PE[15] pin */

/*****************  Bit definition for AFIO_CR register  *****************/
#define AFIO_CR_USBPD_IN_HVT                    ((uint32_t)0x00000200)
#define AFIO_CR_UDP_BC_VSRC                     ((uint32_t)0x00010000)
#define AFIO_CR_UDM_BC_VSRC                     ((uint32_t)0x00020000)
#define AFIO_CR_UDP_BC_CMPE                     ((uint32_t)0x00040000)
#define AFIO_CR_UDM_BC_CMPE                     ((uint32_t)0x00080000)
#define AFIO_CR_UDP_BC_CMPO                     ((uint32_t)0x00100000)
#define AFIO_CR_UDM_BC_CMPO                     ((uint32_t)0x00200000)

/******************  Bit definition for AFIO_AFLR register  *******************/
#define AFIO_AFLR_AFR0                         ((uint32_t)0x0000000F)
#define AFIO_AFLR_AFR0_0                       ((uint32_t)0x00000001)
#define AFIO_AFLR_AFR0_1                       ((uint32_t)0x00000002)
#define AFIO_AFLR_AFR0_2                       ((uint32_t)0x00000004)
#define AFIO_AFLR_AFR0_3                       ((uint32_t)0x00000008)

#define AFIO_AFLR_AFR1                         ((uint32_t)0x000000F0)
#define AFIO_AFLR_AFR1_0                       ((uint32_t)0x00000010)
#define AFIO_AFLR_AFR1_1                       ((uint32_t)0x00000020)
#define AFIO_AFLR_AFR1_2                       ((uint32_t)0x00000040)
#define AFIO_AFLR_AFR1_3                       ((uint32_t)0x00000080)

#define AFIO_AFLR_AFR2                         ((uint32_t)0x00000F00)
#define AFIO_AFLR_AFR2_0                       ((uint32_t)0x00000100)
#define AFIO_AFLR_AFR2_1                       ((uint32_t)0x00000200)
#define AFIO_AFLR_AFR2_2                       ((uint32_t)0x00000400)
#define AFIO_AFLR_AFR2_3                       ((uint32_t)0x00000800)

#define AFIO_AFLR_AFR3                         ((uint32_t)0x0000F000)
#define AFIO_AFLR_AFR3_0                       ((uint32_t)0x00001000)
#define AFIO_AFLR_AFR3_1                       ((uint32_t)0x00002000)
#define AFIO_AFLR_AFR3_2                       ((uint32_t)0x00004000)
#define AFIO_AFLR_AFR3_3                       ((uint32_t)0x00008000)

#define AFIO_AFLR_AFR4                         ((uint32_t)0x000F0000)
#define AFIO_AFLR_AFR4_0                       ((uint32_t)0x00010000)
#define AFIO_AFLR_AFR4_1                       ((uint32_t)0x00020000)
#define AFIO_AFLR_AFR4_2                       ((uint32_t)0x00040000)
#define AFIO_AFLR_AFR4_3                       ((uint32_t)0x00080000)

#define AFIO_AFLR_AFR5                         ((uint32_t)0x00F00000)
#define AFIO_AFLR_AFR5_0                       ((uint32_t)0x00100000)
#define AFIO_AFLR_AFR5_1                       ((uint32_t)0x00200000)
#define AFIO_AFLR_AFR5_2                       ((uint32_t)0x00400000)
#define AFIO_AFLR_AFR5_3                       ((uint32_t)0x00800000)

#define AFIO_AFLR_AFR6                         ((uint32_t)0x0F000000)
#define AFIO_AFLR_AFR6_0                       ((uint32_t)0x01000000)
#define AFIO_AFLR_AFR6_1                       ((uint32_t)0x02000000)
#define AFIO_AFLR_AFR6_2                       ((uint32_t)0x04000000)
#define AFIO_AFLR_AFR6_3                       ((uint32_t)0x08000000)

#define AFIO_AFLR_AFR7                         ((uint32_t)0xF0000000)
#define AFIO_AFLR_AFR7_0                       ((uint32_t)0x10000000)
#define AFIO_AFLR_AFR7_1                       ((uint32_t)0x20000000)
#define AFIO_AFLR_AFR7_2                       ((uint32_t)0x40000000)
#define AFIO_AFLR_AFR7_3                       ((uint32_t)0x80000000)

/******************  Bit definition for AFIO_AFHR register  *******************/
#define AFIO_AFHR_AFR8                         ((uint32_t)0x0000000F)
#define AFIO_AFHR_AFR8_0                       ((uint32_t)0x00000001)
#define AFIO_AFHR_AFR8_1                       ((uint32_t)0x00000002)
#define AFIO_AFHR_AFR8_2                       ((uint32_t)0x00000004)
#define AFIO_AFHR_AFR8_3                       ((uint32_t)0x00000008)

#define AFIO_AFHR_AFR9                         ((uint32_t)0x000000F0)
#define AFIO_AFHR_AFR9_0                       ((uint32_t)0x00000010)
#define AFIO_AFHR_AFR9_1                       ((uint32_t)0x00000020)
#define AFIO_AFHR_AFR9_2                       ((uint32_t)0x00000040)
#define AFIO_AFHR_AFR9_3                       ((uint32_t)0x00000080)

#define AFIO_AFHR_AFR10                        ((uint32_t)0x00000F00)
#define AFIO_AFHR_AFR10_0                      ((uint32_t)0x00000100)
#define AFIO_AFHR_AFR10_1                      ((uint32_t)0x00000200)
#define AFIO_AFHR_AFR10_2                      ((uint32_t)0x00000400)
#define AFIO_AFHR_AFR10_3                      ((uint32_t)0x00000800)

#define AFIO_AFHR_AFR11                        ((uint32_t)0x0000F000)
#define AFIO_AFHR_AFR11_0                      ((uint32_t)0x00001000)
#define AFIO_AFHR_AFR11_1                      ((uint32_t)0x00002000)
#define AFIO_AFHR_AFR11_2                      ((uint32_t)0x00004000)
#define AFIO_AFHR_AFR11_3                      ((uint32_t)0x00008000)

#define AFIO_AFHR_AFR12                        ((uint32_t)0x000F0000)
#define AFIO_AFHR_AFR12_0                      ((uint32_t)0x00010000)
#define AFIO_AFHR_AFR12_1                      ((uint32_t)0x00020000)
#define AFIO_AFHR_AFR12_2                      ((uint32_t)0x00040000)
#define AFIO_AFHR_AFR12_3                      ((uint32_t)0x00080000)

#define AFIO_AFHR_AFR13                        ((uint32_t)0x00F00000)
#define AFIO_AFHR_AFR13_0                      ((uint32_t)0x00100000)
#define AFIO_AFHR_AFR13_1                      ((uint32_t)0x00200000)
#define AFIO_AFHR_AFR13_2                      ((uint32_t)0x00400000)
#define AFIO_AFHR_AFR13_3                      ((uint32_t)0x00800000)

#define AFIO_AFHR_AFR14                        ((uint32_t)0x0F000000)
#define AFIO_AFHR_AFR14_0                      ((uint32_t)0x01000000)
#define AFIO_AFHR_AFR14_1                      ((uint32_t)0x02000000)
#define AFIO_AFHR_AFR14_2                      ((uint32_t)0x04000000)
#define AFIO_AFHR_AFR14_3                      ((uint32_t)0x08000000)

