openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
/*******************  Bit definition for WWDG_CTLR register  ********************/
#define WWDG_CTLR_T                             ((uint8_t)0x7F) /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CTLR_T0                            ((uint8_t)0x01) /* Bit 0 */
#define WWDG_CTLR_T1                            ((uint8_t)0x02) /* Bit 1 */
#define WWDG_CTLR_T2                            ((uint8_t)0x04) /* Bit 2 */
#define WWDG_CTLR_T3                            ((uint8_t)0x08) /* Bit 3 */
#define WWDG_CTLR_T4                            ((uint8_t)0x10) /* Bit 4 */
#define WWDG_CTLR_T5                            ((uint8_t)0x20) /* Bit 5 */
#define WWDG_CTLR_T6                            ((uint8_t)0x40) /* Bit 6 */

#define WWDG_CTLR_WDGA                          ((uint8_t)0x80) /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define WWDG_CFGR_W                             ((uint16_t)0x007F) /* W[6:0] bits (7-bit window value) */
#define WWDG_CFGR_W0                            ((uint16_t)0x0001) /* Bit 0 */
#define WWDG_CFGR_W1                            ((uint16_t)0x0002) /* Bit 1 */
#define WWDG_CFGR_W2                            ((uint16_t)0x0004) /* Bit 2 */
#define WWDG_CFGR_W3                            ((uint16_t)0x0008) /* Bit 3 */
#define WWDG_CFGR_W4                            ((uint16_t)0x0010) /* Bit 4 */
#define WWDG_CFGR_W5                            ((uint16_t)0x0020) /* Bit 5 */
#define WWDG_CFGR_W6                            ((uint16_t)0x0040) /* Bit 6 */

#define WWDG_CFGR_WDGTB                         ((uint16_t)0x0180) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFGR_WDGTB0                        ((uint16_t)0x0080) /* Bit 0 */
#define WWDG_CFGR_WDGTB1                        ((uint16_t)0x0100) /* Bit 1 */

#define WWDG_CFGR_EWI                           ((uint16_t)0x0200) /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define WWDG_STATR_EWIF                         ((uint8_t)0x01) /* Early Wakeup Interrupt Flag */


/******************************************************************************/
/*                                 QSPI                                      */
/******************************************************************************/
/*******************  Bit definition for QSPI_CR register  *******************/
#define  QSPI_CR_EN                                  ((uint32_t)0x00000001)
#define  QSPI_CR_ABORT                               ((uint32_t)0x00000002)
#define  QSPI_CR_DMAEN                               ((uint32_t)0x00000004)
#define  QSPI_CR_TCEN                                ((uint32_t)0x00000008)

#define  QSPI_CR_START                               ((uint32_t)0x00000020)
#define  QSPI_CR_DFM                                 ((uint32_t)0x00000040)
#define  QSPI_CR_FSEL                                ((uint32_t)0x00000080)

#define  QSPI_CR_FTHRES                              ((uint32_t)0x00001F00)
#define  QSPI_CR_FTHRES_0                            ((uint32_t)0x00000100)
#define  QSPI_CR_FTHRES_1                            ((uint32_t)0x00000200)
#define  QSPI_CR_FTHRES_2                            ((uint32_t)0x00000400)
#define  QSPI_CR_FTHRES_3                            ((uint32_t)0x00000800)
#define  QSPI_CR_FTHRES_4                            ((uint32_t)0x00001000)

#define  QSPI_CR_SIOXEN                              ((uint32_t)0x00002000)
#define  QSPI_CR_TEIE                                ((uint32_t)0x00010000)
#define  QSPI_CR_TCIE                                ((uint32_t)0x00020000)
#define  QSPI_CR_FTIE                                ((uint32_t)0x00040000)
#define  QSPI_CR_SMIE                                ((uint32_t)0x00080000)
#define  QSPI_CR_TOIE                                ((uint32_t)0x00100000)
#define  QSPI_CR_APMS                                ((uint32_t)0x00400000)
#define  QSPI_CR_PMM                                 ((uint32_t)0x00800000)

#define  QSPI_CR_PRESCALER                           ((uint32_t)0xFF000000)
#define  QSPI_CR_PRESCALER_0                         ((uint32_t)0x01000000)
#define  QSPI_CR_PRESCALER_1                         ((uint32_t)0x02000000)
#define  QSPI_CR_PRESCALER_2                         ((uint32_t)0x04000000)
#define  QSPI_CR_PRESCALER_3                         ((uint32_t)0x08000000)
#define  QSPI_CR_PRESCALER_4                         ((uint32_t)0x10000000)
#define  QSPI_CR_PRESCALER_5                         ((uint32_t)0x20000000)
#define  QSPI_CR_PRESCALER_6                         ((uint32_t)0x40000000)
#define  QSPI_CR_PRESCALER_7                         ((uint32_t)0x80000000)

/*******************  Bit definition for QSPI_DCR register  *******************/
#define  QSPI_DCR_CKMODE                             ((uint32_t)0x00000001)

#define  QSPI_DCR_CSHT                               ((uint32_t)0x00000700)
#define  QSPI_DCR_CSHT_0                             ((uint32_t)0x00000100)
#define  QSPI_DCR_CSHT_1                             ((uint32_t)0x00000200)
#define  QSPI_DCR_CSHT_2                             ((uint32_t)0x00000400)

#define  QSPI_DCR_FSIZE                              ((uint32_t)0x001F0000)
#define  QSPI_DCR_FSIZE_0                            ((uint32_t)0x00010000)
#define  QSPI_DCR_FSIZE_1                            ((uint32_t)0x00020000)
#define  QSPI_DCR_FSIZE_2                            ((uint32_t)0x00040000)
#define  QSPI_DCR_FSIZE_3                            ((uint32_t)0x00080000)
#define  QSPI_DCR_FSIZE_4                            ((uint32_t)0x00100000)

/*******************  Bit definition for QSPI_SR register  *******************/
#define  QSPI_SR_TEF                                 ((uint32_t)0x00000001)
#define  QSPI_SR_TCF                                 ((uint32_t)0x00000002)
#define  QSPI_SR_FTF                                 ((uint32_t)0x00000004)
#define  QSPI_SR_SMF                                 ((uint32_t)0x00000008)
#define  QSPI_SR_TOF                                 ((uint32_t)0x00000010)
#define  QSPI_SR_BUSY                                ((uint32_t)0x00000020)

#define  QSPI_SR_FLEVEL                              ((uint32_t)0x00003F00)
#define  QSPI_SR_FLEVEL_0                            ((uint32_t)0x00000100)
#define  QSPI_SR_FLEVEL_1                            ((uint32_t)0x00000200)
#define  QSPI_SR_FLEVEL_2                            ((uint32_t)0x00000400)
#define  QSPI_SR_FLEVEL_3                            ((uint32_t)0x00000800)
#define  QSPI_SR_FLEVEL_4                            ((uint32_t)0x00001000)
#define  QSPI_SR_FLEVEL_5                            ((uint32_t)0x00002000)

