openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
#define  QSPI_SR_IDLEF                               ((uint32_t)0x00010000)

/*******************  Bit definition for QSPI_FCR register  *******************/
#define  QSPI_FCR_CTEF                               ((uint32_t)0x00000001)
#define  QSPI_FCR_CTCF                               ((uint32_t)0x00000002)
#define  QSPI_FCR_CSMF                               ((uint32_t)0x00000008)
#define  QSPI_FCR_CTOF                               ((uint32_t)0x00000010)

/*******************  Bit definition for QSPI_DLR register  *******************/
#define  QSPI_DLR_DL                                 ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_CCR register  *******************/
#define  QSPI_CCR_INSTRUCTION                        ((uint32_t)0x000000FF)
#define  QSPI_CCR_INSTRUCTION_0                      ((uint32_t)0x00000001)
#define  QSPI_CCR_INSTRUCTION_1                      ((uint32_t)0x00000002)
#define  QSPI_CCR_INSTRUCTION_2                      ((uint32_t)0x00000004)
#define  QSPI_CCR_INSTRUCTION_3                      ((uint32_t)0x00000008)
#define  QSPI_CCR_INSTRUCTION_4                      ((uint32_t)0x00000010)
#define  QSPI_CCR_INSTRUCTION_5                      ((uint32_t)0x00000020)
#define  QSPI_CCR_INSTRUCTION_6                      ((uint32_t)0x00000040)
#define  QSPI_CCR_INSTRUCTION_7                      ((uint32_t)0x00000080)

#define  QSPI_CCR_IMODE                              ((uint32_t)0x00000300)
#define  QSPI_CCR_IMODE_0                            ((uint32_t)0x00000100)
#define  QSPI_CCR_IMODE_1                            ((uint32_t)0x00000200)

#define  QSPI_CCR_ADMODE                             ((uint32_t)0x00000C00)
#define  QSPI_CCR_ADMODE_0                           ((uint32_t)0x00000400)
#define  QSPI_CCR_ADMODE_1                           ((uint32_t)0x00000800)

#define  QSPI_CCR_ADSIZE                             ((uint32_t)0x00003000)
#define  QSPI_CCR_ADSIZE_0                           ((uint32_t)0x00001000)
#define  QSPI_CCR_ADSIZE_1                           ((uint32_t)0x00002000)

#define  QSPI_CCR_ABMODE                             ((uint32_t)0x0000C000)
#define  QSPI_CCR_ABMODE_0                           ((uint32_t)0x00004000)
#define  QSPI_CCR_ABMODE_1                           ((uint32_t)0x00008000)

#define  QSPI_CCR_ABSIZE                             ((uint32_t)0x00030000)
#define  QSPI_CCR_ABSIZE_0                           ((uint32_t)0x00010000)
#define  QSPI_CCR_ABSIZE_1                           ((uint32_t)0x00020000)

#define  QSPI_CCR_DCYC                               ((uint32_t)0x007C0000)
#define  QSPI_CCR_DCYC_0                             ((uint32_t)0x00040000)
#define  QSPI_CCR_DCYC_1                             ((uint32_t)0x00080000)
#define  QSPI_CCR_DCYC_2                             ((uint32_t)0x00100000)
#define  QSPI_CCR_DCYC_3                             ((uint32_t)0x00200000)
#define  QSPI_CCR_DCYC_4                             ((uint32_t)0x00400000)

#define  QSPI_CCR_DMODE                              ((uint32_t)0x03000000)
#define  QSPI_CCR_DMODE_0                            ((uint32_t)0x01000000)
#define  QSPI_CCR_DMODE_1                            ((uint32_t)0x02000000)

#define  QSPI_CCR_FMODE                              ((uint32_t)0x0C000000)
#define  QSPI_CCR_FMODE_0                            ((uint32_t)0x04000000)
#define  QSPI_CCR_FMODE_1                            ((uint32_t)0x08000000)

#define  QSPI_CCR_SIOO                               ((uint32_t)0x10000000)

/*******************  Bit definition for QSPI_AR register  *******************/
#define  QSPI_AR_ADDR                                ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_ABR register  *******************/
#define  QSPI_ABR_ALTERNATE                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_DR register  *******************/
#define  QSPI_DR_DATA                                ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_PSMKR register  *******************/
#define  QSPI_PSMKR_MASK                             ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_PSMAR register  *******************/
#define  QSPI_PSMAR_MATCH                            ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for QSPI_PIR register  *******************/
#define  QSPI_PIR_INTERVAL                           ((uint16_t)0xFFFF)

/*******************  Bit definition for QSPI_LPIR register  *******************/
#define  QSPI_LPIR_TIMEOUT                           ((uint16_t)0xFFFF)

/******************************************************************************/
/*                               DEBUG SUPPORT                                */
/******************************************************************************/
/*******************  Bit definition for DBGMCU_DR register  *******************/
#define DBG_DEBUGMCU_SLEEP                      ((uint32_t)0x00000001)
#define DBG_DEBUGMCU_STOP                       ((uint32_t)0x00000002)
#define DBG_DEBUGMCU_STBY                       ((uint32_t)0x00000004)
#define DBG_DEBUGMCU_IWDG_STOP                  ((uint32_t)0x00000100)
#define DBG_DEBUGMCU_WWDG_STOP                  ((uint32_t)0x00000200)
#define DBG_DEBUGMCU_I2C1SMBUS_TOUT             ((uint32_t)0x00000400)
#define DBG_DEBUGMCU_I2C2SMBUS_TOUT             ((uint32_t)0x00000800)
#define DBG_DEBUGMCU_TIM1_STOP                  ((uint32_t)0x00001000)
#define DBG_DEBUGMCU_TIM2_STOP                  ((uint32_t)0x00002000)
#define DBG_DEBUGMCU_TIM3_STOP                  ((uint32_t)0x00004000)
#define DBG_DEBUGMCU_TIM4_STOP                  ((uint32_t)0x00008000)
#define DBG_DEBUGMCU_CAN_STOP                   ((uint32_t)0x00010000)

/******************************************************************************/
/*                          ENHANCED FUNNCTION                                */
/******************************************************************************/

