openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/inc/ch32v205.h
/****************************  Enhanced register 0  *****************************/
#define EXTEN_PLL_HSI_PRE                       ((uint32_t)0x00000010) /* Bit 4 */
#define EXTEN_LOCKUP_EN                         ((uint32_t)0x00000040) /* Bit 5 */
#define EXTEN_LOCKUP_RSTF                       ((uint32_t)0x00000080) /* Bit 7 */

#define EXTEN_ULLDO_TRIM                        ((uint32_t)0x00000700) /* ULLDO_TRIM[2:0] bits */
#define EXTEN_ULLDO_TRIM_0                      ((uint32_t)0x00000100) /* Bit 0 */
#define EXTEN_ULLDO_TRIM_1                      ((uint32_t)0x00000200) /* Bit 1 */
#define EXTEN_ULLDO_TRIM_2                      ((uint32_t)0x00000400) /* Bit 2 */

#define EXTEN_LDO_TRIM                          ((uint32_t)0x00003000) /* LDO_TRIM[1:0] bits */
#define EXTEN_LDO_TRIM_0                        ((uint32_t)0x00001000) /* Bit 0 */
#define EXTEN_LDO_TRIM_1                        ((uint32_t)0x00002000) /* Bit 1 */

#define EXTEN_LDO_TRIM0                         ((uint32_t)0x00000000) 
#define EXTEN_LDO_TRIM1                         ((uint32_t)0x00001000) 
#define EXTEN_LDO_TRIM2                         ((uint32_t)0x00002000) 
#define EXTEN_LDO_TRIM3                         ((uint32_t)0x00003000) 

/****************************  Enhanced register 1  *****************************/
#define EXTEN_DMA_ADC_RM                        ((uint16_t)0x0001) 
#define EXTEN_DMA_SPI1_RM                       ((uint16_t)0x0002) 
#define EXTEN_DMA_SPI2_RM                       ((uint16_t)0x0004) 
#define EXTEN_DMA_TIM1_UP_RM                    ((uint16_t)0x0008) 
#define EXTEN_DMA_TIM2_CH4_RM                   ((uint16_t)0x0010) 
#define EXTEN_DMA_TIM2_UP_RM                    ((uint16_t)0x0020) 
#define EXTEN_DMA_TIM3_CH1_RM                   ((uint16_t)0x0040) 
#define EXTEN_DMA_TIM3_CH3_RM                   ((uint16_t)0x0080) 
#define EXTEN_DMA_TIM3_CH4_RM                   ((uint16_t)0x0100) 
#define EXTEN_DMA_TIM4_CH1_RM                   ((uint16_t)0x0200) 
#define EXTEN_DMA_TIM4_CH3_RM                   ((uint16_t)0x0400) 
#define EXTEN_DMA_TIM4_UP_RM                    ((uint16_t)0x0800) 

#include "ch32v205_conf.h"

#ifdef __cplusplus
}
#endif

#endif 
